; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v1 ?v6)
             (pred_4 ?v8 ?v9)
             (pred_3 ?v1 ?v9)
             (pred_6 ?v5 ?v1 )
	     (pred_8 ?v1)
             (pred_1 ?v10)
             (pred_2 ?v8)
             (pred_7 ?v9)
             (pred_9 ?v1)
             (pred_11 ?v8)
             (pred_12 ?v1)
             (pred_5 ))



(:action op_4
:parameters (?v12 ?v7 ?v2 ?v4)
:precondition (and (pred_1 ?v12) (pred_1 ?v7) (pred_2 ?v2) (pred_7 ?v4)
          (pred_10 ?v12 ?v7) (pred_4 ?v2 ?v4)
                   (pred_3 ?v7 ?v4) (pred_8 ?v12) 
                   (pred_9 ?v7) (pred_11 ?v2))
:effect (and  (pred_12 ?v7) (not (pred_9 ?v7))))


(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_1 ?v12) (pred_1 ?v3)
               (pred_8 ?v12) (pred_10 ?v12 ?v3) (pred_12 ?v3))
:effect (and (pred_8 ?v3) (not (pred_8 ?v12))))

(:action op_1
:parameters (?v12 ?v2)
:precondition (and (pred_1 ?v12) (pred_2 ?v2) 
                  (pred_8 ?v12) (pred_6 ?v2 ?v12) (pred_5 ))
:effect (and (pred_11 ?v2)
   (not (pred_6 ?v2 ?v12)) (not (pred_5 ))))


(:action op_3
:parameters (?v12 ?v11 ?v13)
:precondition (and (pred_1 ?v12) (pred_2 ?v11) (pred_2 ?v13)
                  (pred_8 ?v12) (pred_11 ?v13) (pred_6 ?v11 ?v12))
:effect (and (pred_11 ?v11) (pred_6 ?v13 ?v12)
        (not (pred_11 ?v13)) (not (pred_6 ?v11 ?v12))))

(:action op_5
:parameters (?v12 ?v2)
:precondition (and (pred_1 ?v12) (pred_2 ?v2) 
                  (pred_8 ?v12) (pred_11 ?v2))
:effect (and (pred_5 ) (pred_6 ?v2 ?v12) (not (pred_11 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_24 obj_11 obj_15 obj_27 obj_25 obj_03 obj_17 obj_10 obj_01 obj_06 obj_16 obj_18 obj_04 obj_28 obj_29 obj_19 obj_22 obj_30 obj_26 obj_21 obj_02 obj_08 obj_23 obj_14
    obj_12 obj_20 obj_07
    obj_09 obj_31 obj_13
    )

    (:init
       (pred_5)

       (pred_1 obj_05)
       (pred_1 obj_24)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_27)
       (pred_1 obj_25)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_16)
       (pred_1 obj_18)
       (pred_1 obj_04)
       (pred_1 obj_28)
       (pred_1 obj_29)
       (pred_1 obj_19)
       (pred_1 obj_22)
       (pred_1 obj_30)
       (pred_1 obj_26)
       (pred_1 obj_21)
       (pred_1 obj_02)
       (pred_1 obj_08)
       (pred_1 obj_23)
       (pred_1 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_20)
       (pred_7 obj_07)
       (pred_2 obj_09)
       (pred_2 obj_31)
       (pred_2 obj_13)

       (pred_10 obj_05 obj_25)
       (pred_10 obj_05 obj_24)
       (pred_10 obj_24 obj_03)
       (pred_10 obj_24 obj_11)
       (pred_10 obj_24 obj_05)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_24)
       (pred_10 obj_15 obj_10)
       (pred_10 obj_15 obj_27)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_27 obj_15)
       (pred_10 obj_25 obj_06)
       (pred_10 obj_25 obj_03)
       (pred_10 obj_25 obj_05)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_03 obj_24)
       (pred_10 obj_03 obj_25)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_15)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_01 obj_28)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_06 obj_29)
       (pred_10 obj_06 obj_16)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_16 obj_06)
       (pred_10 obj_18 obj_22)
       (pred_10 obj_18 obj_04)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_04 obj_30)
       (pred_10 obj_04 obj_28)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_18)
       (pred_10 obj_28 obj_26)
       (pred_10 obj_28 obj_01)
       (pred_10 obj_28 obj_04)
       (pred_10 obj_29 obj_21)
       (pred_10 obj_29 obj_19)
       (pred_10 obj_29 obj_06)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_22)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_29)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_22 obj_30)
       (pred_10 obj_22 obj_18)
       (pred_10 obj_22 obj_19)
       (pred_10 obj_30 obj_23)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_30 obj_04)
       (pred_10 obj_30 obj_22)
       (pred_10 obj_26 obj_14)
       (pred_10 obj_26 obj_28)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_21 obj_02)
       (pred_10 obj_21 obj_29)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_02 obj_21)
       (pred_10 obj_08 obj_23)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_23 obj_14)
       (pred_10 obj_23 obj_30)
       (pred_10 obj_23 obj_08)
       (pred_10 obj_14 obj_26)
       (pred_10 obj_14 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_22)
       (pred_9 obj_21)
       (pred_3  obj_19 obj_12)
       (pred_3  obj_22 obj_20)
       (pred_3  obj_21 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_24)
       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_27)
       (pred_12 obj_25)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_28)
       (pred_12 obj_29)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_02)
       (pred_12 obj_08)
       (pred_12 obj_23)
       (pred_12 obj_14)

       (pred_4  obj_09 obj_12)
       (pred_4  obj_31 obj_20)
       (pred_4  obj_13 obj_07)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_31 obj_23)
       (pred_6 obj_13 obj_05)
       (pred_8 obj_10)
    )

    (:goal (and
       (pred_6 obj_09 obj_30)
    ))
(:constraints
  (always (not (pred_8 obj_17)))
)
)

; plan
1. (op_2 obj_10 obj_04)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_04)
   goals met: 0 of 1
2. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 0 of 1
3. (op_2 obj_18 obj_16)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_16)
   goals met: 0 of 1
4. (op_2 obj_16 obj_03)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_03)
   goals met: 0 of 1
5. (op_1 obj_03 obj_09)
   deleted: (pred_6 obj_09 obj_03) (pred_5)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_2 obj_03 obj_16)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_18)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_18)
   goals met: 0 of 1
8. (op_2 obj_18 obj_04)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_04)
   goals met: 0 of 1
9. (op_2 obj_04 obj_30)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_30)
   goals met: 0 of 1
10. (op_5 obj_30 obj_09)
   deleted: (pred_11 obj_09)
   added: (pred_5) (pred_6 obj_09 obj_30)
   goals met: 1 of 1
